laravel_api/app/Http/Controllers/AuthController.php

select * from `users` where `email` = 'test@example.com' limit 1
---
    public function login(Request $request)
    {
        $request->validate([
            'email'    => 'required|email',
            'password' => 'required',
        ]);

        $user = User::where('email', $request->email)->first();