laravel_api/app/Http/Controllers/Api/BookController.php

select * from `books`
---
    public function index()
    {
        // リソースを使いフォーマットを合わせて返却
        $products = Book::all();