laravel_api/app/Http/Controllers/Api/CafeController.php

    public function index()
    {
        // リソースを使いフォーマットを合わせて返却
        $cafes = Cafe::all();
---
select * from `cafes`

    public function store(Request $request)
    {
        $cafe = Cafe::create([
            'name' => $request->name,
            'price' => $request->price,
            'category' => $request->category,
        ]);
---
insert into `cafes` (`name`, `price`, `category`, `updated_at`, `created_at`) values ('カフェラテ', 600, 'ドリンク', '2025-05-30 04:57:10', '2025-05-30 04:57:10')