laravel_api/app/Http/Controllers/Api/PlayerController.php

    public function store(Request $request)
    {
        $player = Player::create([
            'name' => $request->name,
            'team_id' => $request->team_id,
        ]);
---
insert into `players` (`name`, `team_id`, `updated_at`, `created_at`) values ('テストです', 1, '2025-05-30 03:43:45', '2025-05-30 03:43:45')

    public function update(Request $request, string $id)
    {
        DB::beginTransaction();                 // ① 取引開始

        try {
            /* 1) 対象プレーヤー取得 */
            $player = Player::findOrFail($id);

            /* 2) players テーブル更新 */
            $player->update([
                'name'    => $request->name,
                'team_id' => $request->team_id,
            ]);

            /* 3) pivot 用配列を組み立て */
            $syncData = [];
            foreach ($request->positions ?? [] as $row) {
                $syncData[$row['id']] = [
                    'skill'         => $row['skill']         ?? null,
                    'assigned_from' => $row['assigned_from'] ?? null,
                ];
            }

            /* 4) pivot を sync で置き換え */
            $player->positions()->sync($syncData);
---
select * from `players` where `players`.`id` = '1' limit 1
update `players` set `name` = 'レコバ', `team_id` = 3, `players`.`updated_at` = '2025-05-30 04:23:38' where `id` = 1
delete from `player_position` where `player_position`.`player_id` = 1 and `player_position`.`position_id` in (1)
insert into `player_position` (`assigned_from`, `player_id`, `position_id`, `skill`) values ('2021-07-01', 1, 5, 90)

        }

        /* 5) 最新状態を返却 */
        return new PlayerResource(
            $player->fresh()->load(['team', 'positions'])
        );
---
select * from `teams` where `teams`.`id` in (3)
select `positions`.*, `player_position`.`player_id` as `pivot_player_id`, `player_position`.`position_id` as `pivot_position_id`, `player_position`.`skill` as `pivot_skill`, `player_position`.`assigned_from` as `pivot_assigned_from` from `positions` inner join `player_position` on `positions`.`id` = `player_position`.`position_id` where `player_position`.`player_id` in (1)