laravel_api/app/Http/Controllers/Api/ProductController.php

select * from `products`
---
    public function index()
    {
        // シンプル
        // return response()->json(
        //     ['hello world!'], 200
        // );

        // jsonで返却
        // $products = Product::all();
        // return response()->json([
        //     'data' => $products
        // ], 200);

        // リソースを使いフォーマットを合わせて返却
        $products = Product::all();

select * from `products` where `products`.`id` = '1' limit 1
---
    public function show(string $id)
    {
        // $product = Product::findOrFail($id);
        // return response()->json([
        //     'data' => $product
        // ], 200);

          // リソースクラスを使うように変更
        $product = Product::findOrFail($id);