laravel_api/app/Http/Controllers/Api/TeamController.php

    public function index()
    {
        $teams = Team::query()->select(['id','name'])->get();

        return TeamResource::collection(
            Team::query()->select(['id','name'])->orderBy('name')->get()
        );
---
select `id`, `name` from `teams`

    public function show(string $id)
    {

        // 1回目: チーム取得
        $team = Team::findOrFail($id);
---
select * from `teams` where `teams`.`id` = '1' limit 1